python/throught_aware_router_demo/2025-03-28_21-03-22/tokens/experiment_1/benchmark.log
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, dataset_name='sharegpt', dataset_path='./LARGER_GAP_short_80_long_20_sharegpt_requests.json', model='Qwen/Qwen2.5-1.5B-Instruct', tokenizer=None, num_prompts=1024, sharegpt_output_len=100, random_input_len=None, random_output_len=None, random_range_ratio=0.0, request_rate=inf, seed=1, multi=False, request_rate_range='2,34,2', output_file=None, disable_tqdm=False, disable_stream=False, disable_ignore_eos=False, extra_request_body=None, max_concurrency=64, gen_num_groups=64, gen_prompts_per_group=16, gen_system_prompt_len=2048, gen_question_len=128, gen_output_len=256)

Total number of conversations: 10925
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
100%|██████████| 1024/1024 [05:03<00:00,  3.38it/s]

============ Serving Benchmark Result ============
Backend:                                 vllm      
Traffic request rate:                    inf       
Successful requests:                     1023      
Long requests:                           136       
Short requests:                          887       
Benchmark duration (s):                  303.29    
Total input tokens:                      540979    
Total generated tokens:                  520300    
Total generated tokens (retokenized):    520127    
Request throughput (req/s):              3.37      
Input token throughput (tok/s):          1783.69   
Output token throughput (tok/s):         1715.51   
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17465.48  
Median E2E Latency (ms):                 3870.83   
P95 E2E Latency (ms):                    70448.75  
P99 E2E Latency (ms):                    71944.51  
Long requests Mean E2E Latency (ms):     67267.43162358088
Short requests Mean E2E Latency (ms):    9829.556966003383
Long requests Median E2E Latency (ms):   68929.08765799999
Short requests Median E2E Latency (ms):  3787.386864000041
Long requests P95 E2E Latency (ms):      71827.50493524999
Short requests P95 E2E Latency (ms):     68295.8075403
Long requests P99 E2E Latency (ms):      72586.19233985002
Short requests P99 E2E Latency (ms):     71583.57305926002
---------------Time to First Token----------------
Mean TTFT (ms):                          522.64    
Median TTFT (ms):                        289.01    
P95 TTFT (ms):                           2315.42   
P99 TTFT (ms):                           3138.52   
Long Requests Mean TTFT (ms):            655.16    
Short Requests Mean TTFT (ms):           502.32    
Long Requests Median TTFT (ms):          500.00    
Short Requests Median TTFT (ms):         259.30    
Long Requests P95 TTFT (ms):             1518.71   
Short Requests P95 TTFT (ms):            2316.40   
Long Requests P99 TTFT (ms):             2978.20   
Short Requests P99 TTFT (ms):            3147.76   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.07     
Median TPOT (ms):                        34.31     
P99 TPOT (ms):                           41.00     
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.46     
Median ITL (ms):                         43.63     
P99 ITL (ms):                            159.97    
==================================================